st/lesson2/report.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:t arch:headline ^:nil
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:nil e:nil email:t f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:nil title:t toc:t todo:t |:t
#+TITLE: 実習2：統計的仮説の検定
#+SUBTITLE: 
#+DATE: 
#+AUTHOR: 情報科学類３年 江畑 拓哉 (201611350)
#+EMAIL: 
#+LANGUAGE: ja
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 24.5.1 (Org mode 9.0.2)

#+LATEX_CLASS: koma-article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER: 
#+LATEX_HEADER: 
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+STARTUP: indent overview inlineimages
* 課題(1)
** サンプルプログラムの出力は何を表す数値であるか。
   　4つのケースそれぞれの危険域を超えた回数
** 標本の大きさについて5, 10, 50, 100の4つのケースを考え、それぞれのケースについて1000回ずつ仮説検定を行った結果を示せ。
   　サンプル・プログラム kentei.m をそのまま実行した。
   #+ATTR_LATEX: :environment longtable :align |c|c|c|c|c|
   |----------------+-----+-----+------+------|
   | 標本の大きさ   |   5 |  10 |   50 |  100 |
   |----------------+-----+-----+------+------|
   | 仮説検定の結果 | 951 | 998 | 1000 | 1000 |
   |----------------+-----+-----+------+------|
** 標本サイズを小さくすると、帰無仮説H0が棄却される割合はどのように変化するか。
   　標本サイズを小さくすると、仮説検定の結果危険域を超えたサンプルの数が減っていることがわかる。つまり帰無仮説が棄却されない割合が増加してしまうということがわかる。
   　例えば標本の大きさ100についてはそのすべてが平均値に差があると判定されているが、標本の大きさが5の場合では49回も平均に差がないと判定されてしまっている。
** 標本サイズが大きいとき、母平均同士の差の大きさは検定結果にどのような影響を与えるか、標本サイズが100の場合を例にして、母平均の差が小さい場合と大きい場合の結果を比較して述べよ。
   　サンプル・プログラム kentei.m の ``myu2'' の値を変化させて実行し標本サイズ100の場合の危険域を超えた数を比較した。
   #+ATTR_LATEX: :environment longtable :align |c|c|c|c|c|
   |------------------------+------+------+------+------|
   | myu2                   | 1.22 | 1.44 | 1.64 | 1.86 |
   |------------------------+------+------+------+------|
   | 危険域を超えた数    | 1000 |  996 |  998 | 1000 |
   |------------------------+------+------+------+------|
   
   　上の結果から標本サイズが十分に大きい時、2つの平均が近いほど危険域に入らない（平均の差が見られない）可能性が高いことがわかる。
* 課題(2)
** 状況設定2での真の状態は、帰無仮説H0が正しいか、対立仮説H1が正しいか。
   　帰無仮説H0は平均値の差が検出できないことで、今回``myu1''と``myu2''が等しいので、つまり平均値の差がゼロであるので、帰無仮説H0が正しいと考えられる。
** 状況設定2で、課題(1)と同様の検定を行ってみて得られた結果を記せ。
   #+ATTR_LATEX: :environment longtable  :align |c|c|c|c|c|
   |----------------+----+----+----+-----|
   | 標本の大きさ   |  5 | 10 | 50 | 100 |
   |----------------+----+----+----+-----|
   | 仮説検定の結果 | 51 | 47 | 46 | 42  |
   |----------------+----+----+----+-----|
** 得られた結果は何を意味しているか。
   　同じ平均を持ったデータについて平均の差を調べると、確かに平均の差が検出できていないことがわかる。それでもいくつかは平均に差があると判定されてしまっている。
* 課題(3)
  　片側検定の有意水準5%の値は1.645であるから、有意水準の値を変え、``abs(T)>L''を``T<L''に変えて検定を行った。
  　以下の結果から、課題(1)と比べて有意水準を超えた数が多いことから、片側検定は両側検定よりも帰無仮説が棄却されやすいと考えられる。
  　但し片側検定なので、パフォーマンスが低下している場合にはこの検定は正しく動作しないことに注意しなければならない。
** A'
   #+ATTR_LATEX: :environment longtable :align |c|c|c|c|c|
      |----------------+-----+-----+------+------|
      | 標本の大きさ   |   5 |  10 |   50 |  100 |
      |----------------+-----+-----+------+------|
      | 仮説検定の結果 | 966 | 999 | 1000 | 1000 |
      |----------------+-----+-----+------+------|
** B'
   #+ATTR_LATEX: :environment longtable :align |c|c|c|c|c|
      |----------------+-----+-----+------+------|
      | 標本の大きさ   |   5 |  10 |   50 |  100 |
      |----------------+-----+-----+------+------|
      | 仮説検定の結果 | 958 | 998 | 1000 | 1000 |
      |----------------+-----+-----+------+------|
** c'
   #+ATTR_LATEX: :environment longtable :align |c|c|c|c|c|
      |----------------+-----+-----+------+------|
      | 標本の大きさ   |   5 |  10 |   50 |  100 |
      |----------------+-----+-----+------+------|
      | 仮説検定の結果 | 727 | 927 | 1000 | 1000 |
      |----------------+-----+-----+------+------|
** D'
   #+ATTR_LATEX: :environment longtable :align |c|c|c|c|c|
      |----------------+-----+-----+-----+------|
      | 標本の大きさ   |   5 |  10 |  50 |  100 |
      |----------------+-----+-----+-----+------|
      | 仮説検定の結果 | 300 | 479 | 966 | 999  |
      |----------------+-----+-----+-----+------|
