st/lesson2/report.tex
% Intended LaTeX compiler: pdflatex
\documentclass{scrartcl}
    \usepackage{amsmath, amssymb, bm}
		\usepackage[utf8]{inputenc}
		\usepackage[dvipdfmx]{graphicx}
		\usepackage[dvipdfmx]{color}
		\usepackage[backend=biber,bibencoding=utf8]{biblatex}
		\usepackage{url}
		\usepackage{indentfirst}
		\usepackage[normalem]{ulem}
		\usepackage{longtable}
		\usepackage{minted}
		\usepackage{fancyvrb}
    \usepackage[dvipdfmx,colorlinks=false,pdfborder={0 0 0}]{hyperref}
    \usepackage{pxjahyper}
    \usepackage{caption}
\author{情報科学類３年 江畑 拓哉 (201611350)}
\date{}
\title{実習2：統計的仮説の検定}
\begin{document}

\maketitle
\tableofcontents

\section{課題(1)}
\label{sec:orgc837445}
\subsection{サンプルプログラムの出力は何を表す数値であるか。}
\label{sec:orgfd2aa49}
　4つのケースそれぞれの危険域を超えた回数\\
\subsection{標本の大きさについて5, 10, 50, 100の4つのケースを考え、それぞれのケースについて1000回ずつ仮説検定を行った結果を示せ。}
\label{sec:orgcfbe6c1}
　サンプル・プログラム kentei.m をそのまま実行した。\\
\begin{longtable}{|c|c|c|c|c|}
\hline
標本の大きさ & 5 & 10 & 50 & 100\\
\hline
\endfirsthead
\multicolumn{5}{l}{前ページからの続き} \\
\hline

標本の大きさ & 5 & 10 & 50 & 100 \\

\hline
\endhead
\hline\multicolumn{5}{r}{次ページに続く} \\
\endfoot
\endlastfoot
\hline
仮説検定の結果 & 951 & 998 & 1000 & 1000\\
\hline
\end{longtable}
\subsection{標本サイズを小さくすると、帰無仮説H0が棄却される割合はどのように変化するか。}
\label{sec:orgfc06faf}
　標本サイズを小さくすると、仮説検定の結果危険域を超えたサンプルの数が減っていることがわかる。つまり帰無仮説が棄却されない割合が増加してしまうということがわかる。\\
　例えば標本の大きさ100についてはそのすべてが平均値に差があると判定されているが、標本の大きさが5の場合では49回も平均に差がないと判定されてしまっている。\\
\subsection{標本サイズが大きいとき、母平均同士の差の大きさは検定結果にどのような影響を与えるか、標本サイズが100の場合を例にして、母平均の差が小さい場合と大きい場合の結果を比較して述べよ。}
\label{sec:org867db3a}
　サンプル・プログラム kentei.m の ``myu2'' の値を変化させて実行し標本サイズ100の場合の危険域を超えた数を比較した。\\
\begin{longtable}{|c|c|c|c|c|}
\hline
myu2 & 1.22 & 1.44 & 1.64 & 1.86\\
\hline
\endfirsthead
\multicolumn{5}{l}{前ページからの続き} \\
\hline

myu2 & 1.22 & 1.44 & 1.64 & 1.86 \\

\hline
\endhead
\hline\multicolumn{5}{r}{次ページに続く} \\
\endfoot
\endlastfoot
\hline
危険域を超えた数 & 1000 & 996 & 998 & 1000\\
\hline
\end{longtable}

　上の結果から標本サイズが十分に大きい時、2つの平均が近いほど危険域に入らない（平均の差が見られない）可能性が高いことがわかる。\\
\section{課題(2)}
\label{sec:org28be291}
\subsection{状況設定2での真の状態は、帰無仮説H0が正しいか、対立仮説H1が正しいか。}
\label{sec:org79b0465}
　帰無仮説H0は平均値の差が検出できないことで、今回``myu1''と``myu2''が等しいので、つまり平均値の差がゼロであるので、帰無仮説H0が正しいと考えられる。\\
\subsection{状況設定2で、課題(1)と同様の検定を行ってみて得られた結果を記せ。}
\label{sec:org3df39f3}
\begin{longtable}{|c|c|c|c|c|}
\hline
標本の大きさ & 5 & 10 & 50 & 100\\
\hline
\endfirsthead
\multicolumn{5}{l}{前ページからの続き} \\
\hline

標本の大きさ & 5 & 10 & 50 & 100 \\

\hline
\endhead
\hline\multicolumn{5}{r}{次ページに続く} \\
\endfoot
\endlastfoot
\hline
仮説検定の結果 & 51 & 47 & 46 & 42\\
\hline
\end{longtable}
\subsection{得られた結果は何を意味しているか。}
\label{sec:org8875bc8}
　同じ平均を持ったデータについて平均の差を調べると、確かに平均の差が検出できていないことがわかる。それでもいくつかは平均に差があると判定されてしまっている。\\
\section{課題(3)}
\label{sec:orgf0b86b8}
　片側検定の有意水準5\%の値は1.645であるから、有意水準の値を変え、``abs(T)>L''を``T<L''に変えて検定を行った。\\
　以下の結果から、課題(1)と比べて有意水準を超えた数が多いことから、片側検定は両側検定よりも帰無仮説が棄却されやすいと考えられる。\\
　但し片側検定なので、パフォーマンスが低下している場合にはこの検定は正しく動作しないことに注意しなければならない。\\
\subsection{A'}
\label{sec:orgecb1f9e}
\begin{longtable}{|c|c|c|c|c|}
\hline
標本の大きさ & 5 & 10 & 50 & 100\\
\hline
\endfirsthead
\multicolumn{5}{l}{前ページからの続き} \\
\hline

標本の大きさ & 5 & 10 & 50 & 100 \\

\hline
\endhead
\hline\multicolumn{5}{r}{次ページに続く} \\
\endfoot
\endlastfoot
\hline
仮説検定の結果 & 966 & 999 & 1000 & 1000\\
\hline
\end{longtable}
\subsection{B'}
\label{sec:org06e06b6}
\begin{longtable}{|c|c|c|c|c|}
\hline
標本の大きさ & 5 & 10 & 50 & 100\\
\hline
\endfirsthead
\multicolumn{5}{l}{前ページからの続き} \\
\hline

標本の大きさ & 5 & 10 & 50 & 100 \\

\hline
\endhead
\hline\multicolumn{5}{r}{次ページに続く} \\
\endfoot
\endlastfoot
\hline
仮説検定の結果 & 958 & 998 & 1000 & 1000\\
\hline
\end{longtable}
\subsection{c'}
\label{sec:orgf8de22d}
\begin{longtable}{|c|c|c|c|c|}
\hline
標本の大きさ & 5 & 10 & 50 & 100\\
\hline
\endfirsthead
\multicolumn{5}{l}{前ページからの続き} \\
\hline

標本の大きさ & 5 & 10 & 50 & 100 \\

\hline
\endhead
\hline\multicolumn{5}{r}{次ページに続く} \\
\endfoot
\endlastfoot
\hline
仮説検定の結果 & 727 & 927 & 1000 & 1000\\
\hline
\end{longtable}
\subsection{D'}
\label{sec:org6f6e8f4}
\begin{longtable}{|c|c|c|c|c|}
\hline
標本の大きさ & 5 & 10 & 50 & 100\\
\hline
\endfirsthead
\multicolumn{5}{l}{前ページからの続き} \\
\hline

標本の大きさ & 5 & 10 & 50 & 100 \\

\hline
\endhead
\hline\multicolumn{5}{r}{次ページに続く} \\
\endfoot
\endlastfoot
\hline
仮説検定の結果 & 300 & 479 & 966 & 999\\
\hline
\end{longtable}
\end{document}
